wjblanke/moviecart/firmware/stm32/src/main.c
/*
 * Boot progress on the status LED. Every blink keeps serving the bus, so these
 * are free to leave in: they are the only way to tell how far boot got when the
 * picture itself is unusable.
 *
 *   1  title synchronized    5  mount failed
 *   2  card mounted          6  title never synchronized
 *   3  movie file opened     8  no playable file found
 *   4  first field valid
 *
 * Field faults (title probe and every playback frame) were all reported as a
 * single "7", which hid which of three different things went wrong. They are now
 * split, because they point at different layers:
 *
 *   7   field header wrong ("MVC\0" missing) — wrong bytes, right length
 *   9   field geometry invalid (visibleLines / numBlocks out of range)
 *   10  sector read failed after DISK_READ_RETRIES — the card/read path, not
 *       the data. Previously this hung silently on the last good frame; that is
 *       the readable-diagnostic rule, so it now has a code.
 *
 * One result is a *pattern* rather than a count — a long 2 s strobe means the same
 * sector read cleanly into the SRAM2 scratch buffer, so the SRAM1 field buffer is
 * the bad DMA target, not the sector computation. See fatalStrobe().
 *
 * MOVIECART_SD_STAGE stops after a chosen milestone and hands the bus back to
 * the plain title loop, so a failure can be bisected one step at a time instead
 * of guessing which layer starved the bus.
 */
#define BLINK_FIELD_HEADER	7u
#define BLINK_FIELD_GEOMETRY	9u
#define BLINK_SECTOR_READ	10u

static bool disk_mount_ok;
static bool disk_open_ok;
static uint8_t playback_field_blocks;

static void
mount_work(void)
{
	disk_mount_ok = pf_mount();
}

static void
open_work(void)
{
	disk_open_ok = pf_open_file(&state.i_numFrames, 1);
}

static void
setupDisk(void)
{
#if MOVIECART_SD_STAGE == 1
	emulate_cartridge();
#endif
	mount_work();
	if (!disk_mount_ok)
		fatalBlink(5);
	flash_led(2);

#if MOVIECART_SD_STAGE == 2
#if MOVIECART_GAP_PROBE
	mc_probe_report();
#else
	emulate_cartridge();
#endif
#endif
	state.io_frameNumber = 1;
	state.io_bits &= ~STATE_PLAYING;
	open_work();
	if (!disk_open_ok)
		fatalBlink(8);
	flash_led(3);

#if MOVIECART_SD_STAGE == 3
	emulate_cartridge();
#endif
}

#define FIELD_LOAD_ATTEMPTS	4

static struct frameInfo *pending_frame;
static uint32_t pending_offset;
static uint8_t pending_attempt;
static uint8_t field_dma_pending;

static struct frameInfo *
inactiveFrameInfo(void)
{
	return r_coreInfo.mr_bufferIndex
		? &r_coreInfo.mr_frameInfo1
		: &r_coreInfo.mr_frameInfo2;
}

/*
 * Start the field's one CMD18 transfer, but deliberately do not drain or poll
 * it here. DMA may finish while the other buffer is visible.
 */
static uint8_t
beginFieldRead(struct frameInfo *fInfo, uint32_t offset, uint8_t attempt)
{
	if (!playback_field_blocks)
		return BLINK_FIELD_GEOMETRY;

	mc_sdio_gate_relaxed = 1;
	pf_seek_block(offset);
	bool started = pf_read_blocks_begin(fInfo->buffer,
					    playback_field_blocks);
	mc_sdio_gate_relaxed = 0;

	if (!started)
		return BLINK_SECTOR_READ;

	pending_frame = fInfo;
	pending_offset = offset;
	pending_attempt = attempt;
	field_dma_pending = 1;
	return 0;
}

/*
 * Drain the transfer started in the preceding blanking interval. A failed read
 * is restarted into the same inactive buffer; it is never marked ready or
 * exposed to VisibleBars until both DMA completion and field validation pass.
 *
 * Return 0 when a buffer became ready, 1 when a retry was started, or an LED
 * fault code when all attempts failed.
 */
static uint8_t
finishFieldRead(void)
{
	mc_sdio_gate_relaxed = 1;
	bool read_ok = pf_read_blocks_finish();
	mc_sdio_gate_relaxed = 0;
	field_dma_pending = 0;

	uint8_t fault = 0;
	if (!read_ok) {
		fault = BLINK_SECTOR_READ;
	} else if (memcmp(pending_frame->buffer, "MVC\0", 4) != 0) {
		fault = BLINK_FIELD_HEADER;
	} else {
		frameInit(pending_frame);
		if (!pending_frame->visibleLines || !pending_frame->numBlocks ||
		    pending_frame->numBlocks > FIELD_MAX_BLOCKS ||
		    pending_frame->numBlocks != playback_field_blocks)
			fault = BLINK_FIELD_GEOMETRY;
	}

	if (!fault) {
		updateBuffer(&state, pending_frame);
		mc_field_swap_to_display();
		return 0;
	}

	if (++pending_attempt >= FIELD_LOAD_ATTEMPTS)
		return fault;

	mc_diag_note(DIAG_FIELD_RETRY);
	disk_read_invalidate();
	if (beginFieldRead(pending_frame, pending_offset, pending_attempt))
		return fault;
	return 1;
}

static void
coreInfoToState(void)
{
	state.i_swcha = (uint8_t)r_coreInfo.mr_swcha;
	state.i_swchb = (uint8_t)r_coreInfo.mr_swchb;
	state.i_inpt4 = (uint8_t)r_coreInfo.mr_inpt4;
	state.i_inpt5 = (uint8_t)r_coreInfo.mr_inpt5;

	state.i_swcha = ((state.i_swcha << 4) | (state.i_swcha & 0x0f)) & state.i_swcha;
	state.i_inpt4 &= state.i_inpt5;
}

static uint32_t title_offset;
static uint8_t *title_dst;
static uint8_t title_probe_fault;	/* 0 ok, else BLINK_* or 0xff for strobe */

static void
title_probe_work(void)
{
	pf_seek_block(title_offset);
	if (!pf_read_block(title_dst)) {
		title_probe_fault = BLINK_SECTOR_READ;
		return;
	}
	if (memcmp(title_dst, "MVC\0", 4) != 0) {
		title_probe_fault = field_reads_ok_in_scratch(title_offset)
			? 0xffu : BLINK_FIELD_HEADER;
		return;
	}
	title_probe_fault = 0;
}

static void
runTitle(void)
{
	uint16_t m_titleFrame = 300;

	state.io_frameNumber = 1;
	title_offset = (uint32_t)(state.io_frameNumber * FIELD_NUM_BLOCKS);

	waitEndFrame();
	if (!r_coreInfo.mr_bufferIndex)
		waitEndFrame();

	/*
	 * Probing the file's geometry needs a whole sector of scratch, and the only
	 * spare 512 bytes is a live display buffer — so this deliberately reads on
	 * top of the title's colour data and restores it immediately below.
	 */
	struct frameInfo fInfo;
	fInfo.buffer = r_coreInfo.mr_frameInfo1.colorBuf;
	title_dst = fInfo.buffer;
	title_probe_work();
	if (title_probe_fault == 0xffu)
		fatalStrobe();
	if (title_probe_fault)
		fatalBlink(title_probe_fault);

	frameInit(&fInfo);
	if (!fInfo.visibleLines || !fInfo.numBlocks ||
	    fInfo.numBlocks > FIELD_MAX_BLOCKS)
		fatalBlink(BLINK_FIELD_GEOMETRY);
	playback_field_blocks = fInfo.numBlocks;
	uint8_t fileVis = fInfo.visibleLines;

	flash_led(4);

	copy_title(r_coreInfo.mr_frameInfo1.colorBuf, TitleColor1, 512);

	int diff = (int)fileVis - (int)r_coreInfo.mr_frameInfo1.visibleLines;

